finance/algotrading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2019-08-16 Fri 09:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algorithmic Trading</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="algo, trading" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Algorithmic Trading</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b58da9">1. Overview</a>
<ul>
<li><a href="#orgf76e40b">1.1. categories</a></li>
<li><a href="#org7a0dd65">1.2. generic parameters</a></li>
</ul>
</li>
<li><a href="#orgf076051">2. Impact-driven</a>
<ul>
<li><a href="#org0e4b16c">2.1. TWAP</a></li>
<li><a href="#org2805f88">2.2. VWAP</a></li>
<li><a href="#org4eae3a5">2.3. POV(Percent of Volume)</a></li>
<li><a href="#orga6175eb">2.4. Minimal Impact</a></li>
</ul>
</li>
<li><a href="#orgd4f34fe">3. Cost-driven</a>
<ul>
<li><a href="#org52ad4dc">3.1. Implementation Shortfall(IS)</a></li>
</ul>
</li>
<li><a href="#orgf720ecc">4. Opportunistic</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4b58da9" class="outline-2">
<h2 id="org4b58da9"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Algorithms</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Focus</th>
<th scope="col" class="org-left">Dynamic</th>
<th scope="col" class="org-left">Pre-determine</th>
<th scope="col" class="org-left">Price</th>
<th scope="col" class="org-left">Volume</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TWAP</td>
<td class="org-left">Impact-driven</td>
<td class="org-left">Time</td>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VWAP</td>
<td class="org-left">Impact-driven</td>
<td class="org-left">Volume</td>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Percentage Of Volume</td>
<td class="org-left">Impact-driven</td>
<td class="org-left">Volume</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">often</td>
</tr>

<tr>
<td class="org-left">Minimal impact</td>
<td class="org-left">Impact-driven</td>
<td class="org-left">Impact</td>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sometimes</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Implementation Shortfall</td>
<td class="org-left">Cost-driven</td>
<td class="org-left">Price/Risk</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">sometimes</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Adaptive Shortfall</td>
<td class="org-left">Cost-driven</td>
<td class="org-left">Price/Risk</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">often</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Market On Close</td>
<td class="org-left">Cost-driven</td>
<td class="org-left">Price/Risk</td>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sometimes</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Price Inline</td>
<td class="org-left">Opportunistic</td>
<td class="org-left">Price</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">often</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Liquidity-driven</td>
<td class="org-left">Opportunistic</td>
<td class="org-left">Liquidity</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">sometimes</td>
<td class="org-left">sometimes</td>
</tr>

<tr>
<td class="org-left">Pair/Spread trading</td>
<td class="org-left">Opportunistic</td>
<td class="org-left">Ratio/Spread</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
<td class="org-left">often</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
At the macro level use a more schedule-driven algorithms, while at the micro level they focus on balancing the trade-off between cost and risk
</p>
</div>

<div id="outline-container-orgf76e40b" class="outline-3">
<h3 id="orgf76e40b"><span class="section-number-3">1.1</span> categories</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Schedule-driven: follow a strictly defined trading trajectory, created statically from historical data</li>
<li>Opportunistic: completely dynamic, react to favourable market conditions. more aggressive when market becomes favourable</li>
<li>Evaluative: middle between these two extremes</li>
</ul>
</div>
</div>

<div id="outline-container-org7a0dd65" class="outline-3">
<h3 id="org7a0dd65"><span class="section-number-3">1.2</span> generic parameters</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>start/end</li>
<li>limit price</li>
<li>Must-be-filled</li>
<li>execution style: aggressive, passive</li>
<li>volume limit: maximum, child, minimum</li>
<li>auctions: flag, allow trading in the pre-trade or post-trade period</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf076051" class="outline-2">
<h2 id="orgf076051"><span class="section-number-2">2</span> Impact-driven</h2>
<div class="outline-text-2" id="text-2">
<p>
Impact-driven algorithms aim to minimize the overall market impact.
TWAP and VWAP are first generation of impact-driven algorithms, their main focus is their respective benchmarks.
</p>
<ul class="org-ul">
<li>these algorithms has timing risk, particularly for volatile assets</li>
</ul>
</div>

<div id="outline-container-org0e4b16c" class="outline-3">
<h3 id="org0e4b16c"><span class="section-number-3">2.1</span> TWAP</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>predictable way</li>
<li>considerable signalling risk</li>
<li>the only thing other participants do not know is the total size of order</li>
</ul>
</div>

<div id="outline-container-orgc6ca1b8" class="outline-4">
<h4 id="orgc6ca1b8"><span class="section-number-4">2.1.1</span> randomize</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>avoid unfavourable market conditions(small best bid/offer sizes, large price jumps)</li>
<li>increasing the risk of missing the TWAP benchmark</li>
</ul>
</div>
</div>

<div id="outline-container-org9ca1639" class="outline-4">
<h4 id="org9ca1639"><span class="section-number-4">2.1.2</span> variations</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ul class="org-ul">
<li><a id="org97b64c0"></a>aggressive/passive factor<br />
<div class="outline-text-5" id="text-org97b64c0">
<ul class="org-ul">
<li>an aggressive approach issue more orders early on, help reduce timing risk</li>
<li>a passive approach should result in lower market impact costs</li>
</ul>
</div>
</li>

<li><a id="orga8aec69"></a>price adaptive<br />
<div class="outline-text-5" id="text-orga8aec69">
<p>
adjust the trading schedule dynamically based on the market price(a simple price inline algorithm)
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgb150687" class="outline-4">
<h4 id="orgb150687"><span class="section-number-4">2.1.3</span> parameters</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ul class="org-ul">
<li><a id="org47b00f6"></a>tracking<br />
<div class="outline-text-5" id="text-org47b00f6">
<p>
limit how far it may go ahead(or behind) schedule(pecentage or a cash value)
</p>
</div>
</li>

<li><a id="orgeeff985"></a>interval frequency<br />
<div class="outline-text-5" id="text-orgeeff985">
<p>
use randomizations
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2805f88" class="outline-3">
<h3 id="org2805f88"><span class="section-number-3">2.2</span> VWAP</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>use historical volume profiles. \(avg_period/avg_total\)</li>
<li>condition: the day's trading volume follows a similar pattern to the historical profile</li>
<li>modern VWAP determine whether they may get ahead of schedule, and how best to catch up if they are behind their target</li>
<li>performance: 1. how well they track the target; 2.how well they predict market volume</li>
</ul>
</div>

<div id="outline-container-org51e25dc" class="outline-4">
<h4 id="org51e25dc"><span class="section-number-4">2.2.1</span> variations</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>vulnerable to sudden shifts, some versions may monitor current market conditions</li>
<li>some variants tracks short-term price and volume trends and dynamically adjusts their target execution profile accordingly</li>
</ul>
</div>
</div>

<div id="outline-container-org0e53f57" class="outline-4">
<h4 id="org0e53f57"><span class="section-number-4">2.2.2</span> parameters</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ul class="org-ul">
<li><a id="org1519069"></a>tracking<br />
<div class="outline-text-5" id="text-org1519069">
<p>
control over how closely they track the target completion profile via custom parameters or an execution style parameter
</p>
</div>
</li>

<li><a id="org24eb589"></a>start/end<br /></li>

<li><a id="org9afd156"></a>trending/tilting<br />
<div class="outline-text-5" id="text-org9afd156">
<p>
some versions may provide parameters that let the target execution profile be tilted towards either the start or the end of the day
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4eae3a5" class="outline-3">
<h3 id="org4eae3a5"><span class="section-number-3">2.3</span> POV(Percent of Volume)</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>also called volume inline, participation, target volume or follow algorithms</li>
<li>tracking a participation rate: a 20% participation rate of 100,000 total should execute 20,000</li>
<li>keep in line with the observed volume</li>
<li>if several POVs competing for an illiquid asset, they could drive each other on. Use limit price</li>
<li>simply splits a new child order each time is predictable, try to trade more periodically or use aggressive</li>
<li>sudden volume cause a sharp increase in volume, use safe guard, like comparing the target size with the currently available volume on the order book or set a max trade size.</li>
</ul>
</div>

<div id="outline-container-orgcefad33" class="outline-4">
<h4 id="orgcefad33"><span class="section-number-4">2.3.1</span> adjust our participation rate</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
to account for our own trading. e.g. to track participation rate 20% for 1000 executed
</p>
<ul class="org-ul">
<li>\(Participation rate = 200/(1000+200) = 16.667%\), not right</li>
<li>adjustment \(1/(1-p)\). e.g \(1/(1-0.2) = 25%\) of each observed new trade</li>
<li>\(Participation rate = 250/(1000+250) = 20%\)</li>
</ul>
</div>
</div>

<div id="outline-container-org4cb5910" class="outline-4">
<h4 id="org4cb5910"><span class="section-number-4">2.3.2</span> variations</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ul class="org-ul">
<li><a id="org4f3a3f7"></a>incorporate forecasting<br />
<div class="outline-text-5" id="text-org4f3a3f7">
<p>
based on a mixture of historical volume profile, current observed volume and quantitative analytics
</p>
</div>
</li>

<li><a id="orgd0d4d40"></a>price adaptive<br />
<div class="outline-text-5" id="text-orgd0d4d40">
<ul class="org-ul">
<li>adjust the participation rate based on how the current market price compares to a benchmark</li>
<li>some will adapt to the relative price changes for other assets, such as sector or market indices, ETFs</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8a59b6d" class="outline-4">
<h4 id="org8a59b6d"><span class="section-number-4">2.3.3</span> parameters</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ul class="org-ul">
<li><a id="org48170e8"></a>participation rate<br /></li>
<li><a id="org5f04819"></a>tracking<br />
<div class="outline-text-5" id="text-org5f04819">
<p>
how closely they track the target participation rate, allow a more dynamic adjustment of the participation rate
</p>
</div>
</li>

<li><a id="org6c9b67e"></a>volume filter<br />
<div class="outline-text-5" id="text-org6c9b67e">
<p>
help prevent the algorithm needlessly chasing volume
</p>
</div>
</li>

<li><a id="orgf54c557"></a>start/end<br /></li>

<li><a id="org2c9fbc8"></a>must-be-filled<br />
<div class="outline-text-5" id="text-org2c9fbc8">
<p>
allow the algorithm to change its trading style when it is running out of time
</p>
</div>
</li>

<li><a id="org3e9d193"></a>limit price<br /></li>
<li><a id="orgc395f45"></a>execution style<br />
<div class="outline-text-5" id="text-orgc395f45">
<ul class="org-ul">
<li>passive: to achieve price improvement</li>
<li>aggressive: track the participation rate more closely</li>
</ul>

<p>
for illiquid assets more aggressive trading may be necessary to prevent getting behind its targets
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga6175eb" class="outline-3">
<h3 id="orga6175eb"><span class="section-number-3">2.4</span> Minimal Impact</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Next logical progression from VWAP and POV algorithms. Not to track a market-driven benchmark; focused on minimising market impact
</p>
<ul class="org-ul">
<li>avoid signalling risk which depends on both our order size and asset's liquidity</li>
<li>use hidden order types to reduce this risk</li>
<li>use dark pool: Dark pools came about primarily to facilitate block trading by institutional investors who did not wish to impact the markets with their large orders and obtain adverse prices for their trades</li>
<li>may trade 80% on the dark pool(ATS) and trade the remainder using a passive VWAP or POV algorithm</li>
</ul>
</div>

<div id="outline-container-orgb1cb8f5" class="outline-4">
<h4 id="orgb1cb8f5"><span class="section-number-4">2.4.1</span> variations</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>estimate the probability of being filled on the ATS</li>
<li>use impact cost models to forecast the overall potential cost</li>
</ul>
</div>
</div>

<div id="outline-container-org38d738c" class="outline-4">
<h4 id="org38d738c"><span class="section-number-4">2.4.2</span> parameters</h4>
<div class="outline-text-4" id="text-2-4-2">
</div>
<ul class="org-ul">
<li><a id="org3d96c92"></a>visibility<br /></li>
<li><a id="org88342f4"></a>must be filled<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd4f34fe" class="outline-2">
<h2 id="orgd4f34fe"><span class="section-number-2">3</span> Cost-driven</h2>
<div class="outline-text-2" id="text-3">
<p>
Cost-driven algorithms seek to reduce the overall transaction costs, much more than just commissions and spreads.
Implicit costs such as market impact and timing risk are important components of the overall cost.
</p>
<ul class="org-ul">
<li><b>strike a balance between market impact and the overall exposure to timing risk</b></li>
<li>early cost-driven evolved from impact-driven ones by incorporating factors such as timing risk</li>
</ul>
</div>

<div id="outline-container-org52ad4dc" class="outline-3">
<h3 id="org52ad4dc"><span class="section-number-3">3.1</span> Implementation Shortfall(IS)</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgea6dcc0" class="outline-4">
<h4 id="orgea6dcc0"><span class="section-number-4">3.1.1</span> definition</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
represents the diff between the decision price decides to trade and the average price that is actually achieved
</p>
<ul class="org-ul">
<li>benchmark: decision price</li>
</ul>
</div>
</div>

<div id="outline-container-orgc9ca5c7" class="outline-4">
<h4 id="orgc9ca5c7"><span class="section-number-4">3.1.2</span> aim</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
to achieve an average price that minimizes the shortfall when compared with the decision price
</p>
<ul class="org-ul">
<li>key: strike the right balance between market impact and timing risk</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf720ecc" class="outline-2">
<h2 id="orgf720ecc"><span class="section-number-2">4</span> Opportunistic</h2>
<div class="outline-text-2" id="text-4">
<p>
Opportunistic algorithms take advantage whenever the market conditions are favourable
</p>
</div>
</div>
</div>
</body>
</html>
